Repository: SELab-2/UGent-7
Catalog: backend/api/locale/*/LC_MESSAGES/django.po
Languages: nl

# dockerimage.state.queued
source: Docker image is in the queue
nl: Docker image is in de wachtrij

# dockerimage.state.building
source: Docker image is building
nl: Docker image is aan het bouwen.

# dockerimage.state.error
source: Docker image failed to build
nl: Docker image is gefaald om te bouwen.

# submission.state.queued
source: Queued
nl: wachten

# submission.state.running
source: Running
nl: lopen

# submission.state.success
source: Success
nl: succes

# submission.state.failed
source: Failed
nl: gefaald

# submission.error.blockedextension
source: The zip file contains a file with a non-allowed extension.
nl: De zip file bevat een niet toegelaten bestandstype.

# submission.error.obligatedextensionnotfound
source: The submitted zip file doesn't have any file with an obligated file extension.
nl: Er is geen enkel bestand met een bepaalde bestandstype die verplicht is in het ingediende zip-bestand.

# submission.error.dockerimageerror
source: try again later.
nl: Probeer later opnieuw.

# submission.error.timelimit
source: Timelimit exceeded.
nl: Tijdslimit bereikt.

# submission.error.memorylimit
source: Memorylimit exceeded.
nl: Geheugenlimiet bereikt.

# submission.error.unknown
source: Unkown error.
nl: Onbekende fout.

# project.error.structure_checks.already_existing
source: The structure check is already present in the project.
nl: De structuur check was al aanwezig.

# project.error.structure_checks.extension_blocked_and_obligated
source: An extension can't be blocked and obligated at the same time.
nl: Een extensie kan niet geblokkeerd en vereist zijn tegelijkertijd.

# extra_check.error.docker_image
source: The field 'docker_image' is required.
nl: Het veld 'docker_image' is vereist.

# extra_check.error.time_limit
source: The field 'time_limit' has to be between 10 and 1000.
nl: Het veld 'time_limit' moet tussen 10 en 1000 liggen.

# extra_check.error.memory_limit
source: The field 'memory_limit' has to be between 100 and 1024.
nl: Het veld 'memory_limit' moet tussen 100 en 1024 liggen.

# courses.error.invitation_link
source: The invitation link is not unique, please try again.
nl: De uitnodigingslink is niet uniek, probeer het opnieuw.

# courses.error.context
source: The course is not supplied in the context.
nl: De opleiding is niet meegeleverd als context.

# courses.error.students.already_present
source: The student is already present in the course.
nl: De student bevindt zich al in de opleiding.

# courses.error.past_course
source: The course is from a past year, thus cannot be manipulated.
nl: De opleiding die men probeert te manipuleren is van een vorig jaar.

# courses.error.students.not_present
source: The student is not present in the course.
nl: De student bevindt zich niet in de opleiding.

# courses.error.teachers.already_present
source: The teacher is already present in the course.
nl: De lesgever bevindt zich al in de opleiding.

# courses.error.teachers.not_present
source: The teacher is not present in the course.
nl: De lesgever bevindt zich niet in de opleiding.

# courses.error.teachers.last_teacher
source: The course must have at least one teacher.
nl: De opleiding moet minstens één lesgever hebben.

# feedback.error.no_teacher
source: The user is no teacher.
nl: De gebruiker is geen lesgever.

# docker.errors.custom
source: User is not allowed to create public images
nl: Gebruiker is niet toegelaten om publieke afbeeldingen te maken

# group.errors.score_exceeds_max
source: The score exceeds the group's max score.
nl: De score van de groep is groter dan de maximum score.

# group.error.context
source: The group is not supplied in the context.
nl: De groep is niet meegegeven als context waar dat nodig is.

# group.errors.locked
source: The group is currently locked.
nl: De groep is momenteel vergrendeld.

# group.errors.full
source: The group is already full.
nl: De groep is al vol.

# group.errors.not_in_course
source: The student is not present in the related course.
nl: De student bevindt zich niet in de opleiding waartoe het project hoort.

# group.errors.already_in_group
source: The student is already in the group.
nl: De student bevindt zich al in de groep.

# group.errors.not_present
source: The student is currently not in the group.
nl: De student bevindt zich niet in de groep.

# project.errors.invalid_instance
source: Error while parsing the provided zip.
nl: Error tijdens de zip te overlopen.

# project.errors.context
source: The project is not supplied in the context.
nl: Het project is niet meegegeven als context waar dat nodig is.

# project.errors.start_date_in_past
source: The start date of the project lies in the past.
nl: De startdatum van het project ligt in het verleden.

# project.errors.deadline_before_start_date
source: The deadline of the project lies before the start date of the project.
nl: De uiterste inleverdatum voor het project ligt voor de startdatum.

# project.errors.zip_structure
source: Error while parsing the provided zip.
nl: Error tijdens de zip te overlopen.

# project.error.submissions.past_project
source: The deadline of the project has already passed.
nl: De uiterste inleverdatum voor het project is gepasseerd.

# project.error.submissions.non_visible_project
source: The project is currently in a non-visible state.
nl: Het project is niet zichtbaar.

# project.error.submissions.archived_project
source: The project is archived.
nl: Het project is gearchiveerd.

# admins.success.add
source: The admin was successfully added.
nl: De admin is successvol toegevoegd.

# teachers.success.add
source: The teacher was successfully added.
nl: De lesgever is successvol toegevoegd.

# teachers.success.destroy
source: The teacher was successfully destroyed.
nl: De lesgever is succesvol verwijderd.

# courses.success.assistants.add
source: The assistant was successfully added to the course.
nl: De assistent is succesvol toegevoegd aan de opleiding.

# courses.success.assistants.remove
source: The assistant was successfully removed from the course.
nl: De assistent is succesvol verwijderd uit de opleiding.

# courses.success.students.add
source: The student was successfully added to the course.
nl: De student is succesvol toegevoegd aan de opleiding.

# courses.success.students.remove
source: The student was successfully removed from the course.
nl: De student is succesvol verwijderd uit de opleiding.

# courses.success.teachers.add
source: The teacher was successfully added to the course.
nl: De lesgever is succesvol toegevoegd aan de opleiding.

# courses.success.teachers.remove
source: The teacher was successfully removed from the course.
nl: De lesgever is succesvol verwijderd uit de opleiding.

# group.success.students.add
source: The student was successfully added to the group.
nl: De student is succesvol toegevoegd aan de groep.

# group.success.students.remove
source: The student was successfully removed from the group.
nl: De student is succesvol verwijderd uit de groep.

# group.success.submissions.add
source: The submission was successfully added to the group.
nl: De indiening is succesvol toegevoegd aan de groep.

# project.success.groups.created
source: A group was successfully created for the project.
nl: De groep is succesvol toegevoegd aan het project.

# project.success.extra_check.add
source: The extra check check was successfully added to the project.
nl: De extra check is succesvol toegevoegd aan het project.

# students.success.add
source: The student was successfully added.
nl: De student is successvol toegevoegd.

# students.success.destroy
source: The student was successfully destroyed.
nl: De student is successvol verwijderd.
