Repository: SELab-2/UGent-7
Catalog: backend/notifications/locale/*/LC_MESSAGES/django.po
Languages: nl

source: Email %(name)s %(title)s %(description)s
nl: Beste %(name)s U heeft een nieuwe notificatie. %(title)s %(description)s - Ypovoli

source: Title: Score added
nl: Score toegevoegd

source: Description: Score added %(score)s
nl: Je hebt een score ontvangen: %(score)s

source: Title: Score updated
nl: Nieuwe score

source: Description: Score updated %(score)s
nl: Je score is geupdate. Nieuwe score: %(score)s

source: Title: Docker image build success
nl: Docker image succesvol gebouwd

source: Description: Docker image build success %(name)s
nl: Jouw docker image, %(name)s, is succesvol gebouwd

source: Title: Docker image build error
nl: Docker image is gefaald om te bouwen

source: Description: Docker image build error %(name)s
nl: Gefaald om jouw docker image, %(name)s, te bouwen

source: Title: Extra check success
nl: Geslaagd voor een extra check

source: Description: Extra check success %(name)s
nl: Jouw indiening is geslaagd voor de extra check: %(name)s

source: Title: Extra check error
nl: Gefaald voor een extra check

source: Description: Extra check error %(name)s
nl: Jouw indiening is gefaald voor de extra check: %(name)s

source: Title: Structure checks success
nl: Geslaagd voor de structuur checks

source: Description: Structure checks success
nl: Jouw indiening is geslaagd voor alle structuur checks

source: Title: Structure checks error
nl: Gefaald voor een structuur check

source: Description: Structure checks
nl: Jouw indiening is gefaald voor een structuur check

source: Title: Submission received
nl: Indiening ontvangen

source: Description: Submission received
nl: We hebben jouw indiening ontvangen
