Repository: SELab-2/UGent-7
Catalog: backend/authentication/locale/*/LC_MESSAGES/django.po
Languages: nl

# faculties.bioscience_engineering
source: Bioscience Engineering
nl: Bio-ingenieurswetenschappen

# faculties.veterinary_medicine
source: Veterinary Medicine
nl: Diergeneeskunde

# faculties.economics_business_administration
source: Economics and Business Administration
nl: Economie en Bedrijfskunde

# faculties.pharmaceutical_sciences
source: Pharmaceutical Sciences
nl: Farmaceutische Wetenschappen

# faculties.medicine_health_sciences
source: Medicine and Health Sciences
nl: Geneeskunde en Gezondheidswetenschappen

# faculties.engineering_architecture
source: Engineering and Architecture
nl: Ingenieurswetenschappen en Architectuur

# faculties.arts_philosophy
source: Arts and Philosophy
nl: Letteren en Wijsbegeerte

# faculties.political_social_sciences
source: Political and Social Sciences
nl: Politieke en Sociale Wetenschappen

# faculties.psychology_educational_sciences
source: Psychology and Educational Sciences
nl: Psychologie en Pedagogische Wetenschappen

# faculties.law_criminology
source: Law and Criminology
nl: Recht en Criminologie
